soap-api/feature-service-update-xml/FeatureService-Update-XML Sample

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns="http://www.esri.com/schemas/ArcGIS/10.1" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soapenv:Header/>
  <soapenv:Body>
     <ns:Update>
        <LayerOrTableID>0</LayerOrTableID>
        <DataObjects>
           <DataObjectArray xsi:type="ns:ArrayOfDataObject">
                 <DataObject xsi:type="ns:GraphicFeature">
                    <Properties xsi:type="ns:PropertySet">
                       <PropertyArray xsi:type="ns:ArrayOfPropertySetProperty">
                          <PropertySetProperty xsi:type="ns:PropertySetProperty">
                             <Key>OBJECTID</Key>
                             <Value xsi:type="xsd:int">1</Value>
                          </PropertySetProperty>
                          <PropertySetProperty xsi:type="ns:PropertySetProperty">
                             <Key>description</Key>
                             <Value xsi:type="xsd:string">Feel free to Change it</Value>
                          </PropertySetProperty>
                       </PropertyArray>
                    </Properties>
                 </DataObject>
              </DataObjectArray>
        </DataObjects>
        <GdbVersion></GdbVersion>
        <RollbackOnFailure>true</RollbackOnFailure>
        <RollbackOnFailureSpecified>true</RollbackOnFailureSpecified>
     </ns:Update>
  </soapenv:Body>
</soapenv:Envelope>

